	РРР := РОН0 + РР + П (П=1)
	РРР := РОН1 + РР + П (П=1)
	РРР := РОН2 + РР + П (П=1)
	РРР := РОН3 + РР + П (П=1)
	РРР := РОН4 + РР + П (П=1)
	РРР := РОН5 + РР + П (П=1)
	РРР := РОН6 + РР + П (П=1)
	РРР := РОН7 + РР + П (П=1)
	РР := РОН0 + ШИНвх + П (П=1)
	РР := РОН1 + ШИНвх + П (П=1)
	РР := РОН2 + ШИНвх + П (П=1)
	РР := РОН3 + ШИНвх + П (П=1)
	РР := РОН4 + ШИНвх + П (П=1)
	РР := РОН5 + ШИНвх + П (П=1)
	РР := РОН6 + ШИНвх + П (П=1)
	РР := РОН7 + ШИНвх + П (П=1)
	РРР := РОН0 + ШИНвх + П (П=1)
	РРР := РОН1 + ШИНвх + П (П=1)
	РРР := РОН2 + ШИНвх + П (П=1)
	РРР := РОН3 + ШИНвх + П (П=1)
	РРР := РОН4 + ШИНвх + П (П=1)
	РРР := РОН5 + ШИНвх + П (П=1)
	РРР := РОН6 + ШИНвх + П (П=1)
	РРР := РОН7 + ШИНвх + П (П=1)
	РОН0 := РОН0 + ШИНвх + П (П=1)
	РОН1 := РОН1 + ШИНвх + П (П=1)
	РОН2 := РОН2 + ШИНвх + П (П=1)
	РОН3 := РОН3 + ШИНвх + П (П=1)
	РОН4 := РОН4 + ШИНвх + П (П=1)
	РОН5 := РОН5 + ШИНвх + П (П=1)
	РОН6 := РОН6 + ШИНвх + П (П=1)
	РОН7 := РОН7 + ШИНвх + П (П=1)
	РР := РОН0 + РРР + П (П=1)
	РР := РОН1 + РРР + П (П=1)
	РР := РОН2 + РРР + П (П=1)
	РР := РОН3 + РРР + П (П=1)
	РР := РОН4 + РРР + П (П=1)
	РР := РОН5 + РРР + П (П=1)
	РР := РОН6 + РРР + П (П=1)
	РР := РОН7 + РРР + П (П=1)
	РРР := РОН0 + РРР + П (П=1)
	РРР := РОН1 + РРР + П (П=1)
	РРР := РОН2 + РРР + П (П=1)
	РРР := РОН3 + РРР + П (П=1)
	РРР := РОН4 + РРР + П (П=1)
	РРР := РОН5 + РРР + П (П=1)
	РРР := РОН6 + РРР + П (П=1)
	РРР := РОН7 + РРР + П (П=1)
	РОН0 := РРР + П (П=1)
	РОН1 := РРР + П (П=1)
	РОН2 := РРР + П (П=1)
	РОН3 := РРР + П (П=1)
	РОН4 := РРР + П (П=1)
	РОН5 := РРР + П (П=1)
	РОН6 := РРР + П (П=1)
	РОН7 := РРР + П (П=1)
	РРР := РР + ШИНвх + П (П=1)
	ШИНвых := РР + ШИНвх + П (П=1)
	РР := РРР + ШИНвх + П (П=1)
	РРР := РРР + ШИНвх + П (П=1)
	ШИНвых := РРР + П (П=1)
	РОН0 := ШИНвх
	РОН1 := ШИНвх
	РОН2 := ШИНвх
	РОН3 := ШИНвх
	РОН4 := ШИНвх
	РОН5 := ШИНвх
	РОН6 := ШИНвх
	РОН7 := ШИНвх
	ШИНвых := РОН0
	ШИНвых := РОН1
	ШИНвых := РОН2
	ШИНвых := РОН3
	ШИНвых := РОН4
	ШИНвых := РОН5
	ШИНвых := РОН6
	ШИНвых := РОН7
	РРР := РОН0
	РРР := РОН1
	РРР := РОН2
	РРР := РОН3
	РРР := РОН4
	РРР := РОН5
	РРР := РОН6
	РРР := РОН7
	РР := ШИНвх
	РРР := ШИНвх
	ШИНвых := ШИНвх
